/*==============================================================================

    Main.cpp - メイン関数
														Author : Yutaka Suganuma
														Date   : 2018/6/05
==============================================================================*/

/*------------------------------------------------------------------------------
	インクルードファイル
------------------------------------------------------------------------------*/
#include "GameLoop.h"

/*------------------------------------------------------------------------------
	メイン関数
------------------------------------------------------------------------------*/
int APIENTRY WinMain(HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR lpCmdLine, int nCmdShow)
{
	//ゲームループ
	auto gameLoop = new GameLoop(hInstance, hPrevInstance, lpCmdLine, nCmdShow);
	gameLoop->Ran();

	return 0;
}